FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/utilities/fsl_assert.c
/*
 * Copyright (c) 2015-2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_common.h"
#include "fsl_debug_console.h"

#ifndef NDEBUG
    #if ( defined( __CC_ARM ) ) || ( defined( __ARMCC_VERSION ) ) || ( defined( __ICCARM__ ) )
        void __aeabi_assert( const char * failedExpr,
                             const char * file,
                             int line )
        {
            PRINTF( "ASSERT ERROR \" %s \": file \"%s\" Line \"%d\" \n", failedExpr, file, line );

            for( ; ; )
            {
                __BKPT( 0 );
            }
        }
    #elif ( defined( __GNUC__ ) )
        #if defined( __REDLIB__ )
            void __assertion_failed( char * failedExpr )
            {
                PRINTF( "ASSERT ERROR \" %s \n", failedExpr );

                for( ; ; )
                {
                    __BKPT( 0 );
                }
            }
        #else
            void __assert_func( const char * file,
                                int line,
                                const char * func,
                                const char * failedExpr )
            {
                PRINTF( "ASSERT ERROR \" %s \": file \"%s\" Line \"%d\" function name \"%s\" \n", failedExpr, file, line, func );

                for( ; ; )
                {
                    __BKPT( 0 );
                }
            }
        #endif /* defined(__REDLIB__) */
    #endif /* (defined(__CC_ARM) || (defined(__ICCARM__)) || (defined(__ARMCC_VERSION)) */
#endif /* NDEBUG */
